main_menu_text = (
    "👋 <b>Привет</b>\n\n"
    "Ты уже авторизован и можешь загружать любые треки в свой плейлист <b>Яндекс.Музыки</b>.\n"
    "Выбери нужное действие ниже 👇\n\n"
    "📥 <b>Загрузить трек</b> — по названию или по ссылке youtube\n"
    "🎵 <b>Изменить плейлист</b> — выбери, куда сохранять треки\n"
    "❓ <b>Помощь</b> — инструкция и ответы на частые вопросы"
)


help_text = (
    "<b>❓ Как пользоваться ботом:</b>\n\n"

    "1. <b>Выбор плейлиста</b>\n"
    "🎵 Отправь ссылку на <b>свой плейлист</b> Яндекс.Музыки, куда будут загружаться треки.\n"
    "❗️ <b>Важно</b>\n"
    "Плейлист должен быть именно твой, подходят все <b>кроме «Мне нравится»</b>\n"

    "2. <b>Загрузка трека</b>\n"
    "🔍 Введи <b>название</b> трека или пришли <b>ссылку</b> на YouTube — бот сам найдёт и зальёт трек.\n"
    "🎶 Можно вручную указать <b>название</b> перед загрузкой, чтобы оно красиво отображалось в плеере.\n\n"
    "🖼 Также можно выбрать отображаемую <b>обложку</b> — как на youtube, свою или вовсе без обложки – как по кайфу\n\n"
    "<b>💬 Остались вопросы?</b>\n"
    "Напиши <a href='https://t.me/avtilomm'>@avtilomm</a> или вернись в главное меню кнопкой ниже 👇"
)


reg_text = (
    "<b>🔐 Авторизация</b>\n\n"
    "Чтобы начать пользоваться ботом, пожалуйста, <b>авторизуйтесь</b> с помощью кнопки ниже.\n"
    "Это нужно для того, чтобы я мог загружать треки в ваш плейлист Яндекс.Музыки🎧\n\n"
    "👇 Нажмите кнопку ниже"
)


auth_text = (
    "<b>🔐 Авторизация</b>\n\n"
    "🔑 Отправь <b>свой токен</b> для авторизации (начинается с <code>y0_</code>)\n\n"
    "Если не знаешь где взять токен — "
    "<a href='https://oauth.yandex.ru/authorize?response_type=token&client_id=1a6990aa636648e9b2ef855fa7bec2fb'>нажми сюда</a> и авторизуйся через Яндекс.\n"
    "После этого скопируй токен из адресной строки браузера и пришли его боту.\n\n"
    "👇 Жду токен ниже"
)
