main_menu_text = (
    "👋 <b>Привет</b>\n\n"
    "Ты уже авторизован и можешь загружать любые треки в свой плейлист <b>Яндекс.Музыки</b>.\n"
    "Выбери нужное действие ниже 👇\n\n"
    "📥 <b>Загрузить трек</b> — из youtube или собственный mp3-файл\n"
    "🎵 <b>Изменить плейлист</b> — выбери, куда сохранять треки\n"
    "❓ <b>Помощь</b> — инструкция и ответы на частые вопросы"
)


help_text = (
    "<b>❓ Как пользоваться ботом:</b>\n\n"

    "1. <b>Выбор плейлиста</b>\n"
    "🎵 Отправь ссылку на <b>свой плейлист</b> Яндекс.Музыки, куда будут загружаться треки.\n"
    "❗️ <b>Важно:</b> Плейлист должен быть именно твой. Подходят любые, <b>кроме «Мне нравится»</b>\n\n"

    "2. <b>Загрузка трека</b>\n"
    "🔍 Варианты загрузки:\n"
    " • Введи <b>название</b> трека или пришли <b>ссылку</b> на YouTube — бот сам скачает и зальёт\n"
    " • 📁 Отправь <b>mp3-файл</b> напрямую или пересылай из <b>@loaditbot</b>\n\n"

    "🎶 После этого ты сможешь вручную указать <b>название трека</b>, чтобы оно красиво отображалось в плеере\n"
    "🖼 Также выбери <b>обложку</b>: как на YouTube, из mp3, свою или вообще без неё — как по кайфу\n\n"

    "<b>💬 Остались вопросы?</b>\n"
    "Напиши <a href='https://t.me/avtilomm'>@avtilomm</a> или вернись в меню кнопкой ниже 👇"
)



reg_text = (
    "<b>🔐 Авторизация</b>\n\n"
    "Чтобы начать пользоваться ботом, пожалуйста, <b>авторизуйтесь</b> с помощью кнопки ниже.\n"
    "Это нужно для того, чтобы я мог загружать треки в ваш плейлист Яндекс.Музыки🎧\n\n"
    "👇 Нажмите кнопку ниже"
)


auth_text = (
    "<b>🔐 Авторизация</b>\n\n"
    "🔑 Отправь <b>свой токен</b> для авторизации (начинается с <code>y0_</code>)\n\n"
    "Если не знаешь где взять токен — "
    "<a href='https://oauth.yandex.ru/authorize?response_type=token&client_id=1a6990aa636648e9b2ef855fa7bec2fb'>нажми сюда</a> и авторизуйся через Яндекс.\n"
    "После этого скопируй токен из адресной строки браузера и пришли его боту.\n\n"
    "👇 Жду токен ниже"
)


mp3_instruction_text = (
    "<b>📁 Загрузка MP3-файла</b>\n\n"
    "Ты можешь загрузить любой mp3-файл прямо сюда.\n"
    "Если ты используешь <b>@loaditbot</b>, то сделай так:\n\n"
    "1️⃣ Найди трек по названию в @loaditbot\n"
    "2️⃣ Нажми на нужный трек, чтобы он открылся\n"
    "3️⃣ Выбери трек, который ты прислал, нажми <b>Переслать</b> и отправь его в этот чат\n\n"
    "⚠️ Важно: просто нажатие на кнопку в списке — недостаточно. "
    "Нужно выбрать сам трек и вручную переслать его сюда ⏩\n\n"
    "После этого бот автоматически начнёт обработку и предложит задать имя трека и обложку.\n\n"
    "👇 Жду файл ниже"
)
